; -------------------------------------------------------------------------------------------------
;
;Языковой файл 7z SFX Builder
;
;Перевод инструкции:
;Расширение файла должно быть «.ini» для того чтобы сделать языковой файл 7z SFX Builder.
;НЕ удаляйте названия разделов! (например: [LangOptions], [Global] ...)
;Обновите вашу информацию о языке в разделе «LangOptions»
;Сохраните файл в формате Юникод
;Отправьте по электронной почте новые языковые файлы на mirza.b.1695@gmail.com для включения в основную установку.
;
;Следующие символы имеют специальное значение:
;-При использовании в GUI метку или кнопку, он предшествует букве и 
;будет зарегистрирована как «горячая клавиша» для данной функции.
;\n - указывает символ новой строки, которая будет заменена при отображении.
;\~n - указывает двойной символ новой строки.
;\s - указывает на специальные строки (как правило, имена файлов)
;Порядок и количество переменных \s очень важно и не должны быть изменены.
;\~s - тоже самое что и \s. только с кавычками.
;
; -------------------------------------------------------------------------------------------------


[LangOptions]
;здесь запишите по-английски название вашего языка
LANG_NAME="Russian"
;здесь запишите оригинальное название вашего языка
LANG_NATIVE_NAME="Русский"
VERSION=2.1
NAME=Loginvovchyk
;добаьте префикс 'mailto:', если вы вводите вручную адрес электронной почты
CONTACT=mailto:mirza.b.1695@gmail.com

[Global]
TIP_ADD="Добавить"
TIP_EDIT="Редактировать"
TIP_DELETE="Удалить"
TIP_DELETE_ALL="Удалить все"
TIP_MOVE_UP="Переместить вверх"
TIP_MOVE_DOWN="Переместить вниз"
BTN_SAVE="Сохранить"
BTN_CANCEL="Отмена"
CHK_QUOTES="Заключенные в кавычки"
LST_SEC_QUOTES="Кавычки"
ERROR_MSG_TITLE="Ошибка!"
WARNING_MSG_TITLE="Предупреждение"
INFORMATION_MSG_TITLE="Информация"
QUESTION_MSG_TITLE="Вопрос"
BTN_OK="OK"
TEST="Тест"
TIP_BROWSE="Обзор файла"
TIP_OPEN="Открыть местоположение файла"


[Menu]
MENU_FILE="&Файл"
MENU_SETTINGS="&Настройки"
MENU_HELP="&Справка"
MI_OPEN="&Открыть файл..."
MI_RELOAD="&Повторно открыть"
MI_SAVE="&Сохранить"
MI_SAVE_AS="&Сохранить как..."
MI_CLOSE="&Закрыть"
SUB_MENU_RECENT_FILES="&Последние файлы"
MI_CLEAR_LIST="&Очистить список"
MI_EXIT="&Выход"
MI_OPTIONS="&Параметры"
SUB_MENU_LANG="&Язык"
MI_HELP="&Справка"
MI_SITE="&Сайт проекта"
MI_ABOUT="&О программе"
MI_PRESET_MANAGER="Диспетчер шаблонов"


[ToolbarTips]
OPEN="Открыть файл"
SAVE="Сохранить"
SAVE_AS="Сохранить как"
CLOSE="Закрыть файл"
TEST="Тест"
PRESET="Управление профилями"
MAKE_SFX="Создать SFX"
OPTIONS="Настройки программы"


[TabNames]
MAIN="Главная"
TITLE_TEXT="Заголовки/Текст"
DIALOGS="Диалоги"
RUN="Выполнение"
DELETE="Удаление" 
SHORTCUTS="Ярлыки"
SET_ENV="Переменные"
OUTPUT="Вывод"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE="Во временную папку"
CHK_SKIP_LOCKED="Пропустить заблокированные системные файлы"
CHK_DELETE_SFX="Удалить SFX-файлы после распаковки"
CHK_BPT="Тайм-аут BeginPrompt:"
CHK_XDWIDTH="Ширина диалогового окна ExtractDialog:"
CHK_XPWIDTH="Ширина ExtractPath:"
CHK_VOLNAME="Volume name style:"
RAD_OW_MODE_1="Перезаписывать все файлы"
RAD_OW_MODE_2="Не перезаписывать файлы"
RAD_OW_MODE_3="Перезаписывать старые файлы"
RAD_GUI_MODE_1="Показать полный интерфейс"
RAD_GUI_MODE_2="Отключить кнопку 'Отмена' при извлечении"
RAD_GUI_MODE_3="Скрыть все окна интерфейса"
GRP_OW_MODE="Режим перезаписи:"
GRP_GUI_MODE="Режим интерфейса:"
LBL_EXT_PATH="Путь извлечения:"
MI_SFX_NAME="Имя SFX-файла"
MI_SFX_PATH="Путь SFX"
TIP_EDIT="Щелкните здесь, чтобы изменить"
TIP_INSERT="Щелкните здесь, чтобы вставить переменную"
TIP_RELOAD="Обновить"
TIP_OPEN="Открыть с помощью текстового редактора"

[Tab_TitleText]
GRP_TITLE="Заголовок"
GRP_TEXT="Текст"
LBL_WIN_TITLE="Заголовок окна:"
LBL_EXT_PATH_WIN_TITLE="Заголовок окна пути извлечения:"
LBL_EXT_WIN_TITLE="Заголовок окна извлечения:"
LBL_ERROR_WIN_TITLE="Заголовок окна сообщений об ошибках:"
LBL_WARN_WIN_TITLE="Заголовок окна предупреждений:"
LBL_PASSWD_TITLE="Заголовок окна ввода пароля:"
LBL_PASSWD_TEXT="Текст окна ввода пароля:"
LBL_EXT_CANCEL_TEXT="Текст окна отмены извлечения:"

[Tab_RunProgram]
LST_SEC_PARAMETER="Параметры"
LST_SEC_PREFIX="Префикс"
LST_SEC_FILE_FOLDER="Путь к файлу"
LST_SEC_COMMANDS="Команды"

[Tab_Delete]
LST_SEC_PARAMETER="Параметры"
LST_SEC_FILE_FOLDER="Путь к файлу или папке"

[Tab_Shortcuts]
LST_SEC_PARAMETER="Параметры"
LST_SEC_PATH="Путь"
LST_SEC_SRC="Исходный файл"
LST_SEC_CMDS="Команды"
LST_SEC_NAME="Имя"
LST_SEC_DESC="Описание"
LST_SEC_DEST="Каталог для Ярлыка"
LST_SEC_WD="Рабочий каталог"
LST_SEC_ICON="Значок"
LST_SEC_INDEX="Индекс"

[Tab_SetEnvironment]
LST_SEC_NAME="Имя переменной"
LST_SEC_VALUE="Значение"

[Tab_SFX]
BTN_SELECT="Выбрать..."
BTN_MAKE_SFX="Создать SFX"
BTN_SFX_OPTIONS="Параметры SFX"
BTN_EDIT_VERS="Изменить сведения о версии файла"
CHK_INCLUDE_PATH="Добавить путь в файл конфигурации"
CHK_USE_SELECTED_CFG="Использовать выбранный файл конфигурации"
GRP_SFX_FILES="SFX-файлы"
GRP_SFX_ICON="Значок"
LBL_CONFIG_FILE="Файл конфигурации:"
LBL_7Z_ARCHIVE="7z-архив:"
LBL_SFX_MODULE="Модуль SFX:"
LBL_SFX_PATH="Путь SFX:"
LBL_SFX_ICON="Значок SFX:"

[GUI_ProgramOptions]
GUI_TITLE="Настройки программы"
BTN_INTEGRATE="Интегрировать программу в контекстное меню"
BTN_EXPORT="Экспорт..."
MI_REGISTRY="Файл реестра..."
MI_INI="INI-файл..."
CHK_USERMODE="Сохранять настройки в реестре"
CHK_AUTODEFMOD="Использовать модуль по умолчанию, если в загруженной конфигурации его нету"
CHK_IGNORE_EMPTY="Не создавать пустые разделы информации о версии файла"
CHK_AUTO_NAME_SFX="Создать SFX-файл в каталоге SFX-архива, если путь не указан"
CHK_OVERWRITE_FILES="Заменять существующие файлы SFX"
GRP_PROGRAM="Программа"
GRP_SFX="SFX"
LBL_LANGUAGE="Язык интерфейса:"

[GUI_PresetManager]
GUI_TITLE="Диспетчер шаблонов"
GUI_TITLE2="Новый шаблон"
GUI_TITLE3="Переименовать шаблон"
BTN_NEW="Создать"
BTN_LOAD="Загрузить"
BTN_SAVE="Сохранить"
BTN_EDIT="Изменить имя"
BTN_DELETE="Удалить"
LBL_NAME="Введите имя шаблона:"

[GUI_ArchiveSets]
CHK_SUBFILES="Архивировать только файлы/папки, расположенные в данной папке"
LBL_DRAGDROP="Используйте функцию перетаскивания для добавления файлов/папок"
TIP_ADDFILE="Добавить файлы"
TIP_ADDFOLDER="Добавить папку"

[GUI_SFXOpts]
GUI_TITLE="Параметры SFX"
TAB_SFX_OPTIONS="Параметры SFX"
TAB_ARCHIVE_FILES="Архивные файлы"
CHK_USE_UPX="Сжать SFX-модуль с помощью UPX"
CHK_USE_SFX_MOD="Использовать следующий модуль SFX:"
CMB_USE_7ZIP1="Всегда использовать 7-Zip"
CMB_USE_7ZIP2="Использовать 7-Zip, только если указаны архивные файлы"
CMB_USE_7ZIP3="Не использовать 7-Zip, если указан 7z-архив"
CMB_USE_7ZIP4="Никогда не использовать 7-Zip"
LBL_PATH="Путь к 7-Zip"
TIP_BROWSE="Выберите путь к 7-Zip"
TIP_CONFIG="Конфигурация 7-Zip"
7ZIP_TITLE="Конфигурация 7-Zip"
7ZIP_LEVEL="Уровень сжатия:"
7ZIP_METHOD="Метод сжатия:"
7ZIP_DICT="Размер словаря:"
7ZIP_SOLID="Размер сплошного блока:"

[GUI_VersionInfo]
GUI_TITLE="Редактирование информации о версии файла"
BTN_LOAD="Загрузить"
MI_LOAD_SFXMOD="Из выбранного модуля SFX"
MI_LOAD_FILE="Из файла..."
MI_LOAD_VALUES="Загрузить сохраненное"
MI_SAVE_VALUES="Сохранить текущие значения"
CHK_INCLUDE="Добавить информацию в файл конфигурации"
CHK_CHANGE_VERS="Изменить информацию о версии"

[GUI_Gui.MiscFlags]
GUI_TITLE="Изменить флаги GUI/Misc"
BTN_NEW="Создать"
BTN_LOAD="Загрузить"
BTN_RESET="Сброс"
BTN_DELETE="Удалить"
LBL_GUI_FLAG_1="Показать процент извлечения в строке заголовка справа (по умолчанию - слева)"
LBL_GUI_FLAG_2="Не отображать процент извлечения в строке заголовка"
LBL_GUI_FLAG_4="Показать процент извлечения под ProgressBar"
LBL_GUI_FLAG_8="Использовать стиль Windows XP (тема)"
LBL_GUI_FLAG_16="Использовать жирный шрифт для процентов извлечения"
LBL_GUI_FLAG_32="Отображать значок в окне прогресса извлечения"
LBL_GUI_FLAG_64="Использовать окно 'BeginPrompt', чтобы указать путь извлечения"
LBL_GUI_FLAG_128="Использовать отдельное окно для указания пути извлечения"
LBL_GUI_FLAG_256="Подтверждние отмены установки/извлечения"
LBL_GUI_FLAG_512="Не отображать значок в строке заголовка всех окон и на [Alt+Tab]"
LBL_GUI_FLAG_1024="Отображать значок в окне для указания пути извлечения"
LBL_GUI_FLAG_2048="Отображать значок в окне 'BeginPrompt'"
LBL_GUI_FLAG_4096="Изменить значок и названия кнопок. вместо 'Да'-'Нет' должно быть 'OK'-'Отмена'"
LBL_GUI_FLAG_8192="Не показывать ProgressBar на панели задач в Windows 7 или более поздней версии"
LBL_GUI_FLAG_16384="Показать символ '&&' в текстах"
LBL_MISC_FLAG_1="Не проверять свободное место на диске, необходимое для ивзлечения"
LBL_MISC_FLAG_2="Не проверять размер свободной памяти, необходимой для ивзлечения"
LBL_MISC_FLAG_4="Требовать права администратора для всех операций"
LBL_MISC_FLAG_8="Показать окно запроса пароля после окон 'BeginPrompt' и 'ExtractPath'"

[GUI_RunProgram]
GUI_TITLE="Добавление файлов для запуска после извлечения"
GUI_PFX_TITLE="Изменить префиксы"
LBL_PARAMETER="Параметр:"
LBL_FILE="Файл:"
LBL_PREFIX="Префикс:"
LBL_COMMANDS="Команды:"

[GUI_Delete]
GUI_TITLE="Добавление файлов для удаления после извлечения"
LBL_PARAMETER="Параметр:"
LBL_FILE="Файл/Папка:"

[GUI_Shortcuts]
GUI_TITLE="Создание Ярлыков"
RAD_DESKTOP="Рабочий стол"
RAD_START_MENU="Меню Пуск"
RAD_PROGRAMS="Меню Пуск\Программы"
RAD_STARTUP="Автозагрузка"
RAD_CURRENT_USER="Текущий пользователь"
RAD_ALLUSERS="Все пользователи"
GRP_CREATION_PATH="Где создать"
GRP_CREATE_FOR="Создать для"
GRP_PARAMETER="Параметр:"
LBL_SOURCE_FILE="Исходный файл:"
LBL_ARGUMENTS="Аргументы:"
LBL_NAME="Имя ярлыка:"
LBL_DESCRIPTION="Описание Ярлыка:"
LBL_DEST_FOLDER="Каталог для Ярлыка:"
LBL_WORKING_DIR="Рабочий каталог:"
LBL_ICON_FILE="Файл значка:"
LBL_ICON_INDEX="Индекс значка:"

[GUI_SetEnvironment]
GUI_TITLE="Создать переменные среды"
LBL_NAME="Имя:"
LBL_VALUE="Значение:"

[GUI_MakeSFX]
GUI_TITLE="Создание SFX..."
BTN_OPEN="Обзор"
BTN_RUN="Выполнить SFX"
BTN_CLOSE="&Закрыть"
REPORT_PREP="Подготовка..."
REPORT_ARCHIVE1="Создание архива..."
REPORT_ARCHIVE2="7-Zip не существует!"
REPORT_ARCHIVE3="Файл не существует: \~s"
REPORT_ARCHIVE4="Архив создан успешно"
REPORT_ARCHIVE5="Не удалось создать архив!"
REPORT_ERROR1="Не удается найти файл конфигурации: \~s"
REPORT_ERROR2="Следующий файл конфигурации не для 7z SFX-файлов: \~s"
REPORT_ERROR3="Ошибка при создании SFX!"
REPORT_ICON1="Изменение значка SFX..."
REPORT_ICON2="Значок SFX изменен успешно"
REPORT_ICON3="Не удалось изменить значок SFX!"
REPORT_VERSINFO1="Обновление информации о версии..."
REPORT_VERSINFO2="Информация о версии успешно обновлена"
REPORT_VERSINFO3="Невозможно обновить информацию о версии!"
REPORT_UPX1="С жатие с помощью UPX..."
REPORT_UPX2="Сжатие успешно завершено"
REPORT_UPX3="Не удается найти "upx.exe"!"
REPORT_BUILD1="Сборка SFX..."
REPORT_BUILD2="Ошибка при сборке SFX!"
REPORT_FINISH="SFX создан успешно в: \~s"

[MessageBoxes]
;Операции Открыть/сохранить файл
MSGBOX1_1="Не удается найти файл языка!"
MSGBOX1_2="Указанный файл не существует!"
MSGBOX1_3="Файл не загружен или не существует!"
MSGBOX1_4="Указанный файл конфигурации не существует!"
MSGBOX1_5="Вы хотите открыть файл: \~n\~s - ?"
MSGBOX1_6="\~s\nне является файлом конфигурации 7z SFX!\~nЗагрузить его в любом случае?"
MSGBOX1_7="Размер файла больше, чем обычный файл конфигурации!\nЗагрузить его в любом случае?"
MSGBOX1_8="Файл, необходимый для данной операции отсутствует:\n\s"
MSGBOX1_9="Этот файл не является файлом конфигурации! Продолжение невозможно!"
MSGBOX1_10="Вы уверены, что хотите перезагрузить файл?"
MSGBOX1_11="Текущая конфигурация не сохранена. Сохранить ее сейчас?"
MSGBOX1_12="Не удалось прочитать или записать файл! Убедитесь, что у вас есть права администратора."
;Создание SFX
MSGBOX2_1="Путь указанный файлом SFX не существует!"
MSGBOX2_2="Модуль SFX не указан!"
MSGBOX2_3="Указанный модуль SFX не существует или неверного формата!"
MSGBOX2_4="Файлы архивов не указаны!"
MSGBOX2_5="Архив не указан!"
MSGBOX2_6="Указанный архив не существует или неверного формата!"
MSGBOX2_7="Перезаписать существующий файл: \~n\~s - ?"
MSGBOX2_8="7-Zip не существует!"
MSGBOX2_9="Вы хотите использовать следующие файл архива: \~n\~s - ?\~nНажмите "Нет", если хотите создать новый архив из файлов указанных в файле конфигурации."
;Другие операции
MSGBOX3_1="Программа успешно интегрирована в контекстное меню."
MSGBOX3_2="Нажмите «OK», чтобы закрыть окно тестирования"
MSGBOX3_3="Хотите перезаписать существующие значения?"
MSGBOX3_4="Пожалуйста, выберите хотя бы один элемент."
MSGBOX3_5="Пожалуйста, выберите только один элемент."
MSGBOX3_6="Вы уверены, что хотите удалить выбранные элементы?"
MSGBOX3_7="Вы уверены, что хотите удалить все элементы?"
MSGBOX3_8="Указанные данные неверны или пустые!"
MSGBOX3_9="Файл не указан!"
